[
    {
        "id": 1,
        "titulo": "Speak Up Kids",
        "texto": "> Link to Repository: <https://github.com/JPonchiroli/Speak-Up-Kids> \n\n The project was a Capstone Project, from my Systems Analysis and Development Technical Course, programmed internally with just HTML, CSS, JAVASCRIPT, JAVA, JSP and MySQL for the database. \n\n ### About the Platform \n\n Speak Up Kids was a project developed to be a teaching platform for children on the autism spectrum. \n\n The platform has 4 actors: The student who can answer exercise lists and has access to class content; the teacher who includes these lists and content and generally monitors the student to know how the activities are being delivered; the administrator who brings together the teacher and the student, creating classes; and the guardian who also accompanies the student. \n\n ### Resposabilites \n\n I was primarily responsible for the Front-End development in the project, where I worked on the creation and implementation of the user interface. Additionally, I contributed to some areas of the Back-End, focusing on specific improvements to the overall system functionality. I also handled the database connection, ensuring data integrity. \n\n Throughout this period, I encountered technical challenges and sought collaborative solutions with the team, with the support of our teachers, enriching my experience and practical skills. \n\n ### Conclusion \n\n It was my first time programming on a real project, and it was a little intimidating at first because there were many things to learn. I was learning HTML and CSS while working on the project, and the same went for JSP. Nevertheless, I had a lot of help from my teammates. My teachers were always there to assist me in resolving bugs and teaching me how to approach the project in the best way possible."

    },
    {
        "id": 2,
        "titulo": "Foguete Clicker",
        "texto": "> Link to Repository: <https://github.com/JPonchiroli/foguete_clicker> \n\n Project developed with HTML, CSS and JAVASCRIPT.  \n\n \n\n ### About the Project \n\n \n\n The idea for the project came about after I downloaded a clicker game on my cell phone and thought I could make one using javascript. With it I was able to improve my javascript skills, creating several functions using javascript events and DOM manipulation \n\n \n\n ### Conclusion \n\n  \n\n This was a project that I had tried to do several times, but had never managed to do. I only managed to do it after my programming logic classes, looking at the class and seeing that I could use what was being taught for other functions. I was very happy with the completion of the project because after several attempts, I had finally managed to complete it."
    },
    {
        "id": 3,
        "titulo": "To-do-List",
        "texto": "> Link to Repository: <https://github.com/JPonchiroli/todo-list> \n\n  Project developed with JAVA and Spring Boot \n\n  \n\n ### About the Project \n\n  \n\n The project was executed during an intensive week of RocketSeat classes. It focused on the development of a user system, empowering users to create personalized to-do lists. The implementation includes robust validation mechanisms to ensure the secure creation of both users and to-do lists. \n\n  \n\n ### Conclusion \n\n  \n\n I successfully enhanced my proficiency in back-end Java, familiarized myself with a new framework, and gained hands-on experience with an API development platform for the first time."
    },
    {
        "id": 4,
        "titulo": "Barber Landing Page",
        "texto": "> Link to Repository: <https://github.com/JPonchiroli/landing-page-barber> \n\n Project developed with HTML, SCSS and the library AOS for animations  \n\n ### About the Project  \n\n A landing page utilizing HTML, employed SASS for styling, and integrated the AOS library for animations. This marks my initial experience with both SASS and the AOS library.  \n\n ### Conclusão \n\n I found these tools to be incredibly useful and easy to learn. Through this project, I was able to enhance my understanding of HTML and discover new tools that make project creation much more easily."
    },
    {
        "id": 5,
        "titulo": "CRUD with API",
        "texto": "> Link to Repository: <https://github.com/JPonchiroli/Apis-Rest/tree/main/fifth-api> \n\n Project developed with HTML, CSS, JAVASCRIPT, Node.js, Express and MySQL for database  \n\n ### About the Project \n\n A CRUD application using REST API requests has been developed. The project includes an HTML table displaying all registered users with their usernames and passwords. Each user has a DELETE button for account removal and an UPDATE button for modifying user credentials. Additionally, a registration screen is provided for adding new users. The password field on the registration screen includes a function allowing users to view their entered password. \n\n ### Conclusion \n\n This project represents my first experience in REST API with Node.js, and Express.js for the backend. From my perspective, this method is highly useful, productive, and exhibits significant growth potential for future projects. My most challenging aspect was learning the syntax of the methods and structuring the project architecture. Despite the difficulties, I was able to acquire a new and improved approach to building a more effective backend."
    },
    {
        "id": 6,
        "titulo": "Pokemon List",
        "texto": "> Link to Repository: <https://github.com/JPonchiroli/project-pokemon-list> \n\n Project developed with HTML, CSS, JAVASCRIPT  \n\n ### About the Project \n\n A simple pokedex, with gifs and pokemon descriptions developed in html and css, with javascript interactions to change the background. \n\n ### Conclusion \n\n Project made in an intensive week of teaching HTML, CSS and Javascript administered by the brothers from 'Dev em Dobro'. With it I was able to cover my knowledge in both the IT job market and other areas of programming and reinforce my knowledge in programming itself."
    },
    {
        "id": 7,
        "titulo": "Alura Books",
        "texto": "> Link to Repository (React): <https://github.com/JPonchiroli/alura-books> \n\n > Link to Repository (Server): <https://github.com/JPonchiroli/alura-books/server> \n\n  Project developed in the formation '[Full Stack JavaScript: Crie um Projeto com React e Node.js](https://cursos.alura.com.br/user/joaopedroponqueroli/degree-full-stack-react-node-js-455268/certificate)' by Alura with React.js, Node.js, Express \n\n ### About the Project \n\n Developed as part of the 'Formação Full Stack JavaScript: Crie um Projeto com React e Node.js' formation at Alura school, this project has been instrumental in initiating my studies in the React framework and enlarge my knowleage in Node.js with API REST. \n\n\n Through the course, I gained a comprehensive understanding of React's syntax, learned to build applications, and mastered concepts such as components, states, props, dynamic props, the effective use of styled-components library for styling and how to manege the React Router. \n\n\n With Node.js, it wasn't my first time developing requests from the front-end, but it was the first time using it with React and employing a JSON file for storage. Throughout the course, I worked on developing GET, POST, and PATCH requests, as well as implementing DELETE functionality for a book list. Was a great way for to review the content and lear more ways to biuld requests \n\n\n ### Conclusion\n\n\n The course equipped me with the skills to implement array filtering, create a search system, a POST request to a list of favorites books displayed in another screen and a DELETE request to remove the items in the list. React, with its powerful capabilities, has proven to be an invaluable tool in web development. It not only streamlines the coding process but also alleviates project complexities."
    },
    {
        "id": 8,
        "titulo": "Organo",
        "texto": "> Link to Repository: <https://github.com/JPonchiroli/organo> \n\n  Project developed in the courses '[React: Desenvolvendo com JavaScript](https://cursos.alura.com.br/user/joaopedroponqueroli/course/react-desenvolvendo-javascript/certificate)' and '[React: Como os Componentes Funcionam](https://cursos.alura.com.br/user/joaopedroponqueroli/course/react-componentes-funcionam/certificate)' by Alura with React.js \n\n \n\n ### About the Project \n\n \n\n Organo was developed for creating and organizing teams, being able to define the name and color for a new team, in addition to the already registered teams. Being able to add people and positions to a team. After viewing the people added to the team, it is also possible to change the color of the team. \n\n \n\n ### Conclusion \n\n \n\n After completing the course, I was able to expand my knowledge with React, learning more and more about its structure and data manipulation."
    }
]